---
kind: property
id: P:Autodesk.Revit.DB.DetailCurveArray.Item(System.Int32)
source: html/0f6aa000-c3d8-a838-ab35-055d2d9cd0d6.htm
---
# Autodesk.Revit.DB.DetailCurveArray.Item Property

Gets or sets an item at a specified index within the array.

## Syntax (C#)
```csharp
public virtual DetailCurve this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the item to be set or retrieved.

## Returns
Returns the object at the specified index.